# cvss_metrics.py

# Словник метрик
metrics = {
    'AV': {'N': 0.85, 'A': 0.62, 'L': 0.55, 'P': 0.2},
    'AC': {'L': 0.77, 'H': 0.44},
    'PR': {'N': 0.85, 'L': 0.62, 'H': 0.27},
    'UI': {'N': 0.85, 'R': 0.62},
    'S': {'U': 1.0, 'C': 1.0},
    'C': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'I': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'A': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'MC': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'MI': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'MA': {'N': 0.0, 'L': 0.22, 'H': 0.56},
    'E': {'X': 1.0, 'U': 0.85, 'F': 0.97, 'P': 0.90, 'H': 1.0},
    'RL': {'X': 1.0, 'U': 0.95, 'W': 0.96, 'T': 0.97},
    'RC': {'X': 1.0, 'U': 0.92, 'R': 0.96, 'C': 1.0},
    'MAV': {'N': 1.0, 'A': 0.6, 'P': 0.2},
    'CR': {'X': 1.0, 'L': 0.5, 'M': 0.75, 'H': 1.0},
    'IR': {'X': 1.0, 'L': 0.5, 'M': 0.75, 'H': 1.0},
    'AR': {'X': 1.0, 'L': 0.5, 'M': 0.75, 'H': 1.0}
}

# Словник описів метрик
descriptions = {
    'AV': {'N': 'Мережа', 'A': 'Атака через мережу', 'L': 'Локальна атака', 'P': 'Фізична атака'},
    'AC': {'L': 'Низька складність', 'H': 'Висока складність'},
    'PR': {'N': 'Не потрібні права', 'L': 'Низькі права', 'H': 'Високі права'},
    'UI': {'N': 'Не потрібна взаємодія', 'R': 'Потрібна взаємодія'},
    'S': {'U': 'Не змінюється', 'C': 'Змінюється'},
    'C': {'N': 'Немає впливу', 'L': 'Низький вплив', 'H': 'Високий вплив'},
    'I': {'N': 'Немає впливу', 'L': 'Низький вплив', 'H': 'Високий вплив'},
    'A': {'N': 'Немає впливу', 'L': 'Низький вплив', 'H': 'Високий вплив'},
    'E': {'X': 'Не визначено', 'U': 'Малоймовірний', 'F': 'Ймовірний', 'P': 'Дуже ймовірний', 'H': 'Високий'},
    'RL': {'X': 'Не визначено', 'U': 'Малоймовірний', 'W': 'Ймовірний', 'T': 'Дуже ймовірний'},
    'RC': {'X': 'Не визначено', 'U': 'Малоймовірний', 'R': 'Ймовірний', 'C': 'Підтверджений'},
    'MAV': {'N': 'Мережа', 'A': 'Атака через мережу', 'P': 'Фізична атака'},
    'CR': {'X': 'Не визначено', 'L': 'Низький вплив', 'M': 'Середній вплив', 'H': 'Високий вплив'},
    'IR': {'X': 'Не визначено', 'L': 'Низький вплив', 'M': 'Середній вплив', 'H': 'Високий вплив'},
    'AR': {'X': 'Не визначено', 'L': 'Низький вплив', 'M': 'Середній вплив', 'H': 'Високий вплив'}
}
ukrainian_labels = {
    'AV': 'Вектор атаки', 'AC': 'Складність атаки', 'PR': 'Права доступу',
    'UI': 'Взаємодія користувача', 'S': 'Вплив', 'C': 'Конфіденційність',
    'I': 'Цілісність', 'A': 'Доступність', 'E': 'Досвідченість', 'RL': 'Засоби',
    'RC': 'Достовірність', 'MAV': 'Модиф. вектор атаки', 'MAC': 'Модиф. складність атаки',
    'MPR': 'Модиф. права доступу', 'MUI': 'Модиф. взаємодія користувача',
    'MS': 'Модиф. вплив', 'MC': 'Модиф. конфіденційність', 'MI': 'Модиф. цілісність',
    'MA': 'Модиф. доступність'
}